#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_ecr_repository.dashboard: Refreshing state... [id=c18-climate-monitor-dashboard-ecr]
aws_ecr_repository.current_reading_orchestrator: Refreshing state... [id=c18-climate-monitor-current-reading-orchestrator-ecr]
aws_ecr_repository.new_location_orchestrator: Refreshing state... [id=c18-climate-monitor-new-location-orchestrator-ecr]
aws_ecr_repository.current_weather: Refreshing state... [id=c18-climate-monitor-current-weather-ecr]
aws_security_group.allow_5432: Refreshing state... [id=sg-00146638977b9f8dc]
aws_ecr_repository.historic_weather: Refreshing state... [id=c18-climate-monitor-historic-weather-ecr]
aws_ecr_repository.current_air_quality: Refreshing state... [id=c18-climate-monitor-current-air-quality-ecr]
aws_ecr_repository.future_predictions: Refreshing state... [id=c18-climate-monitor-future-predictions-ecr]
aws_ecr_repository.flood_warning_check: Refreshing state... [id=c18-climate-monitor-flood-warning-check-ecr]
aws_ecr_repository.daily_summary: Refreshing state... [id=c18-climate-monitor-daily-summary-ecr]
aws_ecr_repository.historic_air_quality: Refreshing state... [id=c18-climate-monitor-historic-air-quality-ecr]
aws_vpc_security_group_ingress_rule.allow_ingress_5432: Refreshing state... [id=sgr-0c0647e7620fc928e]
aws_db_instance.climate: Refreshing state... [id=db-FRWD4BKFF4THTAGHZDARGIT56U]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_iam_role.lambda will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "c18-data-fernatics-lambda-iam"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # aws_iam_role_policy_attachment.lambda_basic_exec_role will be created
  + resource "aws_iam_role_policy_attachment" "lambda_basic_exec_role" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole"
      + role       = "c18-data-fernatics-lambda-iam"
    }

  # aws_lambda_function.current_air_quality will be created
  + resource "aws_lambda_function" "current_air_quality" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-climate-monitor-current-air-quality-lambda"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-climate-monitor-current-air-quality-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = "c18-climate-monitor-rds.c57vkec7dkkx.eu-west-2.rds.amazonaws.com"
              + "DB_NAME"     = "postgres"
              + "DB_PASSWORD" = "climatemonitordbpswd"
              + "DB_PORT"     = "5432"
              + "DB_USER"     = "climate"
              + "api_key"     = null
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.current_weather will be created
  + resource "aws_lambda_function" "current_weather" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-climate-monitor-current-weather-lambda"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-climate-monitor-current-weather-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 256
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = "c18-climate-monitor-rds.c57vkec7dkkx.eu-west-2.rds.amazonaws.com"
              + "DB_NAME"     = "postgres"
              + "DB_PASSWORD" = "climatemonitordbpswd"
              + "DB_PORT"     = "5432"
              + "DB_USER"     = "climate"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.historic_air_quality will be created
  + resource "aws_lambda_function" "historic_air_quality" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-climate-monitor-historic-air-quality-lambda"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-climate-monitor-historic-air-quality-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 1024
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 400
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = "c18-climate-monitor-rds.c57vkec7dkkx.eu-west-2.rds.amazonaws.com"
              + "DB_NAME"     = "postgres"
              + "DB_PASSWORD" = "climatemonitordbpswd"
              + "DB_PORT"     = "5432"
              + "DB_USER"     = "climate"
              + "api_key"     = null
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_lambda_function.historic_weather will be created
  + resource "aws_lambda_function" "historic_weather" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-climate-monitor-current-weather-lambda"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-climate-monitor-historic-weather-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 400
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "DB_HOST"     = "c18-climate-monitor-rds.c57vkec7dkkx.eu-west-2.rds.amazonaws.com"
              + "DB_NAME"     = "postgres"
              + "DB_PASSWORD" = "climatemonitordbpswd"
              + "DB_PORT"     = "5432"
              + "DB_USER"     = "climate"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

Plan: 6 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @lindengraves, Action: `pull_request`*